#+title: Voice of the Customer Analysis Scripts

This folder contains examples in the R language for statistical computing of how to extract he Voice of the Customer from raw data.

#+begin_src bash :results raw
  # List files and extract first comment line
  for f in *.[Rr]; do
    [ -f "$f" ] || continue
    read -r line < "$f"
    echo "- =$f=: $(echo "$line" | sed 's/^#*[[:space:]]*//')"
  done
#+end_src

#+RESULTS:
- =consumer-involvement.R=: Analyse Customer Survey Data (Involvement)
- =customer-survey.R=: Analyse Customer Survey Data
- =sentiment-analysis.R=: Sentiment Analysis examples
- =twitter-sentiment-anaysis.R=: Tapwater tweet sentiment analysis
- =word-network.R=: Generate network of words within a text
